Revit 2027 API
BuiltInFailures.StairRampFailures.MultistoryStairsComponentJoinFailure Property
 Can't keep elements joined. Avoid converting stairs to skeched-based component in Multistory stairs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultistoryStairsComponentJoinFailure { get; }
Public Shared ReadOnly Property MultistoryStairsComponentJoinFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultistoryStairsComponentJoinFailure {
	FailureDefinitionId^ get ();
}
static member MultistoryStairsComponentJoinFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace